vendor/gems/soap4r-1.5.8/test/xsd/xmllang.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <gepirResponseHeader xmlns="http://www.example.com/xmllang">
      <responderGln>12345</responderGln>
      <numberOfHits>1</numberOfHits>
      <returnCode>0</returnCode>
    </gepirResponseHeader>
  </soap:Header>
  <soap:Body>
    <gepirParty xmlns="http://www.example.com/xmllang">
      <partyDataLine xml:lang="EN">
        <gln>12345</gln>
        <additionalPartyId>234</additionalPartyId>
        <partyName>foobar LLC</partyName>
        <streetAddress>baz</streetAddress>
        <pOBoxNumber>9876</pOBoxNumber>
        <city>Moscow</city>
        <countryISOCode>RU</countryISOCode>
        <contact>
          <contactName>     </contactName>
          <communicationChannel communicationChannelCode="TELEFAX">12; 34 56 78</communicationChannel>
          <communicationChannel communicationChannelCode="EMAIL">foo@example.com</communicationChannel>
          <communicationChannel communicationChannelCode="TELEPHONE">123 456</communicationChannel>
        </contact>
        <contact>
          <communicationChannel communicationChannelCode="EMAIL">bar@example.com</communicationChannel>
        </contact>
        <contact>
          <communicationChannel communicationChannelCode="WEBSITE">www.example.com</communicationChannel>
        </contact>
        <contact>
          <communicationChannel communicationChannelCode="TELEFAX">12 34; 56 78</communicationChannel>
        </contact>
        <contact>
          <communicationChannel communicationChannelCode="TELEPHONE">789 012</communicationChannel>
        </contact>
      </partyDataLine>
    </gepirParty>
  </soap:Body>
</soap:Envelope>
